{
    "2009":{
        "title": "Started my BS degree",
        "location": "Boulder, CO",
        "description":["Majored in Electrical and Computer Engineering at the University of Colorado"]
        
    },
    "2011":{
        "title": "First engineering internship at Cirrus Logic",
        "location": "Austin, TX",
        "description": ["Worked with inventors to write patent applications for electrical LED designs", "Spent a super hot summer in Austin, Texas!"]
    },
    "2012":{
        "title": "Returned for second summer of internship at Cirrus Logic",
        "location": "Austin, TX",
        "description":["Joined Product Marketing Engineering team to see if I wanted to pursue marketing or stay technical (the answer was technical in the end)", "Worked on LED product marketing", "Spent another summer in Weird Austin"]
    },
    "2013":{
        "title": "Finished BS degree, accepted first job",
        "location": "Orange County, CA",
        "description":["Graduated with BS in Electrical and Computer Engineering at University of Colorado", "Moved to Orange County, California for a full-time position at Western Digital as a computer engineer", "Achieved my dream to live in Southern California"]
    },
    "2014":{
        "title": "Switched positions at WD to become an embedded software engineer",
        "location": "Orange County, CA",
        "description":["Changed teams in Western Digital", "Lead the design and implementation of boot ROM firmware for new SoCs. Implemented in C", "Lead the design and implementation of an automation test framework for electrical characterization. Implemented in MATLAB OOP"]
    },
    "2016":{
        "title": "Got promoted to senior embedded firmware engineer",
        "location": "Orange County, CA",
        "description":["At Western Digital", "Became lead designer and implementer of boot ROM firmware"]
        
    },
    "2017":{
        "title": "Left WD. Accepted a graduate school research position and started MS degree",
        "location": "Riverside, CA",
        "description":["Wanted to learn more computer science topics", "Started a MS in Computer Science at University of California, Riverside", "Researched Data Mining techniques under Professor Eamonn Keogh"]
        
    },
    "2019":{
            "title": "The year of many changes!",
            "location": "Orange County, CA",
            "description": ["Left Grad School after completing 80% of degree with 3.9GPA", "Decided to take some time off from industry", "Got married", "Wanted to change gears to switch to doing more front end development", "Built experience with front end web development technologies: HTML, CSS/CSS3, Javascript/ES6+, React", "Taught math in my free time"]
    },
    "2020":{
        "title": "Actively Seeking Front End Development Position",
        "location": "Orange County, CA",
        "description": ["Seeking front end developer positions!", "Working on personal projects", "Teaching math in my free time"]
    }
}